[
  {
    "title": "Professor Cleber Balota",
    "text": "Ser professor do técnico é desafiador pois os alunos já chegam pensando que conhecem TI. Mas ao logo do tempo percebem que TI é muito mais que usar o computador, é, necessário pensar no computador como uma máquina. Ser professor é estimular os alunos para que mantenham a motivação e principalmente a vontade de aprender. Cada turma é uma forma diferentede manter o grupo motivado. São ideias e visões diferente, uns com uma maturidade boa e outras nem tanto. E o mais difícil é nivelar."
  },
  {
    "title": "2015 - Gabriel Schmitz Melo",
    "text": "Fazer o técnico me proporcionou algumas oportunidades de emprego. Logo após me formar no técnico comecei a trabalhar em uma empresa como auxiliar administrativo e o curso estando em meu currículo abriu aoportunidade de trabalhar como auxiliar de TI logo após minha efetivação. Após alguns meses trabalhando como auxiliar, recebi a chancede poder ser responsável do setor de TI, quando meu antigo chefe saiu da empresa. Participei de projetos de infraestrutura e tive algumas oportunidades de cursos internos. Depois de 1 ano na empresa, migrei para outra empresa na qual estou hoje em dia. Empresa de exportação marítima. Entrei como segurança patrimonial e graças ao técnico e minha experiencia na carteira, recebi uma promoção e tive a chance de ir para a TI da empresa em apenas 5 meses após ser efetivado. Hoje trabalho como Analista De Suporte Técnico no terminal Marítimo da Termasa/Tergrasa e se não fosse o técnico não teria tido todas essas oportunidades."
  },
  {
    "title": "2015 - Rafaela Peixoto",
    "text": "O técnico de informática me marcou por me proporcionar a chance de aprender mais sobre esse grande mundo tecnológico e pelas amizades que construi e levo até hoje."
  },
  {
    "title": "2016 - Pedro Souza",
    "text": "O técnico foi bem diferente do que imaginava, não esperava que fosse tão completo quanto foi, com tantas matérias. Trouxe muito conhecimento, e também vontade de continuar pesquisando sobre os assuntos, assuntos que antes nem sabia direito o que eram - como sobre rede e banco de dados, que eu não fazia ideia de como ia ser, mas graças ao professor Cléber e professor Henrique, foram aprendizados bem interessantes. Com o técnico eu adquiri muito mais conhecimento sobre computadores de forma geral, deixando de usar de modo leigo"
  },
  {
    "title": "2017 - Pedro Torres",
    "text": "Minha experiência no técnico foi muito boa, pois não tinha muito conhecimento na área da tecnologia e a partir deste curso comecei aprender mais com os métodos ensinados pelos professores e pude expandir mais meu conhecimento. Além disso conheci pessoas incríveis ao qual criei uma grande amizade tudo graças ao técnico. Os professores sempre nos ajudando e tirando nossas dúvidas e levando pessoas da área da tecnologia pra palestrar e nos mostrar um pouco mais sobre os profissionais que trabalham nessa área."
  },
  {
    "title": "2017 - Thiago Aguiar",
    "text": "Entrei não sabendo nada de programação, os professores em especial o Cleber e o Henrique considero muito, pessoas que além de saber muito da área de informática, conseguem ajudar o aluno com suas experiências devida, o que é muito bom, para mim em especial, que o professor Cleber conseguiu um estágio onde ele mesmo trabalha, mas era mais na área que o professor Henrique dava no código, acabei tendo um aprendizado práticona área."
  },
  {
    "title": "2019 - Mario Torres",
    "text": "Antes de começar a cursar o T.I. na escola, eu pensei que não seria tão difícil até porque quem não sabe usar um computador hoje em dia? De primeiro momento eu pude perceber o quão difícil é realmente saber utilizar o computador, na questão de algoritmos, pois nota-se que a linguagem de máquina é muito mais complexa e completamente diferente do nosso linguajar diário. Mas com o passar do tempo nós fomos sendo introduzindo a estas linguagens, junto a toda história da computação, o que facilitou o aprendizado e hoje eu vejo a diferença que o curso faz na minha vida."
  }
]